In [2]:
import pandas as pd

In [3]:
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

In [4]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']})

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [5]:
pd.DataFrame({"Bob": ["I liked it", "It was awful"], "Jane": ["Pretty Good", "Bland"]}, index=['Product A', "Product B"])

                    Bob         Jane
Product A    I liked it  Pretty Good
Product B  It was awful        Bland

In [8]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
wine_reviews = pd.read_csv("data.csv")
wine_reviews.shape

(3, 4)

In [11]:
wine_reviews.head()

   Product A  Product B  Product C  Unnamed: 3
0         30         21          9         NaN
1         35         34          1         NaN
2         41         11         11         NaN

In [14]:
pd.DataFrame({'Apples': [30], 'Bananas': [21]})

   Apples  Bananas
0      30       21

In [16]:
 pd.DataFrame({"Flour": ["4 cups"], "Milk": ["1 cup"], "Eggs": ["2 large"], "Spam": ["1 can"], "Name": ["Dinner"]})

    Flour   Milk     Eggs   Spam    Name
0  4 cups  1 cup  2 large  1 can  Dinner

In [20]:
i = pd.DataFrame({"Ingredients": ["4 cups", "1 cup", "2 large", "1 can", "Dinner"]}, index =["Flour", "Milk", "Eggs", "Spam", "Name"])

i.iloc[0]

Ingredients    4 cups
Name: Flour, dtype: object